In [1]:
#!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.0.21-py2.py3-none-any.whl (366 kB)
Collecting protobuf>=3.0.0
  Downloading protobuf-3.13.0-py2.py3-none-any.whl (438 kB)
Requirement already satisfied: six>=1.9 in c:\users\bhupe\anaconda3\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Requirement already satisfied: setuptools in c:\users\bhupe\anaconda3\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (49.2.0.post20200714)
Installing collected packages: protobuf, mysql-connector-python
Successfully installed mysql-connector-python-8.0.21 protobuf-3.13.0

In [2]:
import mysql.connector

In [3]:
# Connect to server
cnx = mysql.connector.connect(
    host="127.0.0.1",
    port=3306,
    user="root",
    password="Prisha2102$")

In [16]:
import pandas as pd
con=mysql.connector.connect(
    host="localhost",
    port=3306,
    user="root",
    password="Prisha2102$",
    database="studentdb")
    
 
    
    
df=pd.read_sql_query('select * from student',con)
df
df.head(10)

   id       name
0   1     vishal
1   2      nirav
2   3      montu
3   4  bhupendra
4   5     prisha
5   6      komal
6   7      henry
7   8       john

In [17]:
df.tail()

   id       name
3   4  bhupendra
4   5     prisha
5   6      komal
6   7      henry
7   8       john

In [18]:
df.sample()

   id       name
3   4  bhupendra

In [19]:
df=pd.read_sql_query('select name from student',con)

In [20]:
df

        name
0     vishal
1      nirav
2      montu
3  bhupendra
4     prisha
5      komal
6      henry
7       john

In [21]:
df=pd.read_sql_query('select did from department',con)

In [22]:
df

   did
0    1
1    2
2    3
3    4